src/main/resources/xml/accommodationFulfillmentComponentWSPort/retrieveBookedAccommodation/retrieveBookedAccommodation.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ful="http://fulfillment.accommodation.services.booking.dreams.wdw.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <ful:retrieveBookedAccommodation>
         <!--Optional:-->
         <request>
            <batchContextId>?</batchContextId>
            <!--Optional:-->
            <batchName>?</batchName>
            <!--Optional:-->
            <processDate>?</processDate>
            <travelComponentGroupingId>?</travelComponentGroupingId>
         </request>
         <!--Optional:-->
         <serviceContext>
            <addressRole>?</addressRole>
            <conversationId>?</conversationId>
            <messageId>?</messageId>
            <party1Id>?</party1Id>
            <party1Type>?</party1Type>
            <party2Id>?</party2Id>
            <party2Type>?</party2Type>
            <pathHostName>?</pathHostName>
            <pathId>?</pathId>
            <principalId>?</principalId>
            <principalMethod>?</principalMethod>
            <principalRole>?</principalRole>
            <principalUri>?</principalUri>
            <principalValue>?</principalValue>
            <requestTimeStamp>?</requestTimeStamp>
            <toAddressRole>?</toAddressRole>
            <userName>?</userName>
         </serviceContext>
      </ful:retrieveBookedAccommodation>
   </soapenv:Body>
</soapenv:Envelope>
